SEMESTER-2/Big Data/big-data-exercises-pxl.gitlab.io-master-public/public/plsql/procedures.org
#+TITLE: Oefeningen PL/SQL - Hoofdstuk 3: Procedures
#+AUTHOR: Robin Wils
#+INCLUDE: "../org-options.org"
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../solarized-dark.min.css"/>
-----
[[file:../index.org][Home]] > [[file:plsql.org][PLSQL]] > Procedures \\
[[https://pxl-college-projects.gitlab.io/big-data-exercises-pxl.gitlab.io/plsql/procedures.org][View org source]]

#+TOC: headlines

** Hoe voer ik procedures uit?
Een procedure kan je aanmaken door op de SQL‐prompt in te tikken:
#+BEGIN_SRC
SQL> START <filepath>/procedure_naam
#+END_SRC

Je kan procedure output toestaan door het volgende op de SQL‐prompt 
in te tikken (Dit moet je opnieuw doen als je opnieuw inlogt):
#+BEGIN_SRC
SQL> SET serveroutput on
#+END_SRC

Een procedure kan je uitvoeren door op de SQL‐prompt in te tikken:
#+BEGIN_SRC
SQL> EXEC procedure_naam
#+END_SRC

Een procedure kan je verwijderen door op de SQL‐prompt in te tikken:
#+BEGIN_SRC
SQL> DROP PROCEDURE procedure_naam;
#+END_SRC
** Opgave 1 
Schrijf een procedure ‘toon_laatste_emp’ die in de medewerkerstabel zoekt naar 
de laatst aangeworven medewerker. Toon het nummer, de naam en de 
aanwervingsdatum van deze medewerker.   

Alvorens de procedure uit te voeren, geef je het volgende in: \\
#+BEGIN_SRC plsql
UPDATE employees
SET hire_date = '20‐apr‐00'
WHERE employee_id =173;
#+END_SRC

Deze procedure kan je uitvoeren door op de SQL‐prompt in te tikken:
#+BEGIN_SRC
SQL> EXEC toon_laatste_emp
#+END_SRC

/Er staat een trigger op dat update commando./
/De naam van deze trigger wordt getoont in de error-message wanneer je het
commando uitvoert. Je kan deze trigger droppen via het volgende commando./

#+BEGIN_SRC
SQL> DROP TRIGGER secure_employees;
#+END_SRC

#+BEGIN_SRC plsql
CREATE OR REPLACE PROCEDURE toon_laatste_emp
IS
  v_emp_id employees.employee_id%type;
  v_emp_name employees.last_name%type;
  v_emp_hire_date employees.hire_date%type;
BEGIN
  SELECT employee_id, last_name, hire_date
  INTO v_emp_id, v_emp_name, v_emp_hire_date
  FROM (
    SELECT employee_id, first_name, last_name, hire_date
    FROM employees
    ORDER BY hire_date 
    DESC
  ) 
  WHERE ROWNUM = 1;

  DBMS_OUTPUT.PUT_LINE(
    v_emp_id || ':' || v_emp_name || ':' || v_emp_hire_date
  );
END;
/
#+END_SRC
[[file:../sql-files/procedures/toon_laatste_emp.sql][sql bestand]]

** Opgave 2 
Schrijf een procedure (grootste_dept) die de departementsnaam van het 
departement met de meeste employees opzoekt en van dit departement de naam 
afdrukt samen met de naam, voornaam en het salaris van de employee uit dit 
departement met het hoogste salaris.  

#+BEGIN_SRC plsql
CREATE OR REPLACE PROCEDURE grootste_dept
IS
  v_dept_id departments.department_id%type;
  v_dept_name departments.department_name%type;
  v_name employees.last_name%type;
  v_firstname employees.first_name%type;
  v_salary employees.salary%type;
BEGIN
  SELECT department_name, department_id
  INTO v_dept_name, v_dept_id
  FROM departments 
  JOIN employees
  USING(department_id)
  GROUP BY department_name, department_id
  HAVING COUNT(employees.employee_id) = (
    SELECT MAX(COUNT(*))
    FROM employees
    GROUP BY department_id
  );
  SELECT last_name, first_name, salary
  INTO v_name, v_firstname, v_salary
  FROM employees 
  JOIN departments 
  USING (department_id)
  WHERE department_name = v_dept_name
  AND employees.salary = (
    SELECT MAX(salary)
    FROM employees
    WHERE department_id = v_dept_id
  );
  DBMS_OUTPUT.PUT_LINE(
    'Department: ' || 
    v_dept_name ||
    chr(13) ||
    chr(10) ||
    'Highest salary: ' ||
    v_name ||
    ' ' || 
    v_salary
  );
END;
/
#+END_SRC
[[file:../sql-files/procedures/grootste_dept.sql][sql bestand]]

Deze procedure kan je uitvoeren door op de SQL‐prompt in te tikken:
#+BEGIN_SRC
SQL> EXEC grootste_dept 
#+END_SRC

