SEMESTER-2/Big Data/big-data-exercises-pxl.gitlab.io-master-public/public/plsql/procedures.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-08-14 Wed 16:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Oefeningen PL/SQL - Hoofdstuk 3: Procedures</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Robin Wils" />
<link rel="stylesheet" type="text/css" href="../solarized-dark.min.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Oefeningen PL/SQL - Hoofdstuk 3: Procedures</h1>
<hr />
<p>
<a href="../index.html">Home</a> &gt; <a href="plsql.html">PLSQL</a> &gt; Procedures <br />
<a href="https://pxl-college-projects.gitlab.io/big-data-exercises-pxl.gitlab.io/plsql/procedures.org">View org source</a>
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8ca9c85">Hoe voer ik procedures uit?</a></li>
<li><a href="#org574ca37">Opgave 1</a></li>
<li><a href="#org10f6705">Opgave 2</a></li>
<li><a href="#org60b0c9b">Opgave 3</a></li>
<li><a href="#orgc6c7b9c">Opgave 4</a></li>
<li><a href="#org82be2fc">Opgave 5</a></li>
<li><a href="#org243a50d">Opgave 6</a></li>
<li><a href="#orgf0b594e">Opgave 7</a></li>
<li><a href="#org6e6d045">Opgave 8</a></li>
<li><a href="#org39f70d3">Opgave 9</a></li>
<li><a href="#org8689495">Opgave 10</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8ca9c85" class="outline-2">
<h2 id="org8ca9c85">Hoe voer ik procedures uit?</h2>
<div class="outline-text-2" id="text-org8ca9c85">
<p>
Een procedure kan je aanmaken door op de SQL‐prompt in te tikken:
</p>
<pre class="example">
SQL&gt; START &lt;filepath&gt;/procedure_naam
</pre>

<p>
Je kan procedure output toestaan door het volgende op de SQL‐prompt 
in te tikken (Dit moet je opnieuw doen als je opnieuw inlogt):
</p>
<pre class="example">
SQL&gt; SET serveroutput on
</pre>

<p>
Een procedure kan je uitvoeren door op de SQL‐prompt in te tikken:
</p>
<pre class="example">
SQL&gt; EXEC procedure_naam
</pre>

<p>
Een procedure kan je verwijderen door op de SQL‐prompt in te tikken:
</p>
<pre class="example">
SQL&gt; DROP PROCEDURE procedure_naam;
</pre>
</div>
</div>
<div id="outline-container-org574ca37" class="outline-2">
<h2 id="org574ca37">Opgave 1</h2>
<div class="outline-text-2" id="text-org574ca37">
<p>
Schrijf een procedure ‘toon_laatste_emp’ die in de medewerkerstabel zoekt naar 
de laatst aangeworven medewerker. Toon het nummer, de naam en de 
aanwervingsdatum van deze medewerker.   
</p>

<p>
Alvorens de procedure uit te voeren, geef je het volgende in: <br />
</p>
<div class="org-src-container">
<pre class="src src-plsql"><span style="color: #DD6F48;">UPDATE</span> employees
<span style="color: #DD6F48;">SET</span> hire_date = <span style="color: #528B8B;">'20&#8208;apr&#8208;00'</span>
<span style="color: #DD6F48;">WHERE</span> employee_id =173;
</pre>
</div>

<p>
Deze procedure kan je uitvoeren door op de SQL‐prompt in te tikken:
</p>
<pre class="example">
SQL&gt; EXEC toon_laatste_emp
</pre>

<p>
<i>Er staat een trigger op dat update commando.</i>
<i>De naam van deze trigger wordt getoont in de error-message wanneer je het
commando uitvoert. Je kan deze trigger droppen via het volgende commando.</i>
</p>

<pre class="example">
SQL&gt; DROP TRIGGER secure_employees;
</pre>

<div class="org-src-container">
<pre class="src src-plsql"><span style="color: #DD6F48;">CREATE</span> <span style="color: #DD6F48;">OR</span> REPLACE <span style="color: #DD6F48;">PROCEDURE</span> <span style="color: #A89984;">toon_laatste_emp</span>
<span style="color: #DD6F48;">IS</span>
  v_emp_id employees.employee_id%<span style="color: #DD6F48;">type</span>;
  v_emp_name employees.last_name%<span style="color: #DD6F48;">type</span>;
  v_emp_hire_date employees.hire_date%<span style="color: #DD6F48;">type</span>;
<span style="color: #DD6F48;">BEGIN</span>
  <span style="color: #DD6F48;">SELECT</span> employee_id, last_name, hire_date
  <span style="color: #DD6F48;">INTO</span> v_emp_id, v_emp_name, v_emp_hire_date
  <span style="color: #DD6F48;">FROM</span> (
    <span style="color: #DD6F48;">SELECT</span> employee_id, first_name, last_name, hire_date
    <span style="color: #DD6F48;">FROM</span> employees
    <span style="color: #DD6F48;">ORDER</span> <span style="color: #DD6F48;">BY</span> hire_date 
    <span style="color: #DD6F48;">DESC</span>
  ) 
  <span style="color: #DD6F48;">WHERE</span> ROWNUM = 1;

  DBMS_OUTPUT.PUT_LINE(
    v_emp_id || <span style="color: #528B8B;">':'</span> || v_emp_name || <span style="color: #528B8B;">':'</span> || v_emp_hire_date
  );
<span style="color: #DD6F48;">END</span>;
/
</pre>
</div>
<p>
<a href="../sql-files/procedures/toon_laatste_emp.sql">sql bestand</a>
</p>
</div>
</div>

<div id="outline-container-org10f6705" class="outline-2">
<h2 id="org10f6705">Opgave 2</h2>
<div class="outline-text-2" id="text-org10f6705">
<p>
Schrijf een procedure (grootste_dept) die de departementsnaam van het 
departement met de meeste employees opzoekt en van dit departement de naam 
afdrukt samen met de naam, voornaam en het salaris van de employee uit dit 
departement met het hoogste salaris.  
</p>

<div class="org-src-container">
<pre class="src src-plsql"><span style="color: #DD6F48;">CREATE</span> <span style="color: #DD6F48;">OR</span> REPLACE <span style="color: #DD6F48;">PROCEDURE</span> <span style="color: #A89984;">grootste_dept</span>
<span style="color: #DD6F48;">IS</span>
  v_dept_id departments.department_id%<span style="color: #DD6F48;">type</span>;
  v_dept_name departments.department_name%<span style="color: #DD6F48;">type</span>;
  v_name employees.last_name%<span style="color: #DD6F48;">type</span>;
  v_firstname employees.first_name%<span style="color: #DD6F48;">type</span>;
  v_salary employees.salary%<span style="color: #DD6F48;">type</span>;
<span style="color: #DD6F48;">BEGIN</span>
  <span style="color: #DD6F48;">SELECT</span> department_name, department_id
  <span style="color: #DD6F48;">INTO</span> v_dept_name, v_dept_id
  <span style="color: #DD6F48;">FROM</span> departments 
  <span style="color: #DD6F48;">JOIN</span> employees
  <span style="color: #DD6F48;">USING</span>(department_id)
  <span style="color: #DD6F48;">GROUP</span> <span style="color: #DD6F48;">BY</span> department_name, department_id
  <span style="color: #DD6F48;">HAVING</span> <span style="color: #FE8019;">COUNT</span>(employees.employee_id) = (
    <span style="color: #DD6F48;">SELECT</span> <span style="color: #FE8019;">MAX</span>(<span style="color: #FE8019;">COUNT</span>(*))
    <span style="color: #DD6F48;">FROM</span> employees
    <span style="color: #DD6F48;">GROUP</span> <span style="color: #DD6F48;">BY</span> department_id
  );
  <span style="color: #DD6F48;">SELECT</span> last_name, first_name, salary
  <span style="color: #DD6F48;">INTO</span> v_name, v_firstname, v_salary
  <span style="color: #DD6F48;">FROM</span> employees 
  <span style="color: #DD6F48;">JOIN</span> departments 
  <span style="color: #DD6F48;">USING</span> (department_id)
  <span style="color: #DD6F48;">WHERE</span> department_name = v_dept_name
  <span style="color: #DD6F48;">AND</span> employees.salary = (
    <span style="color: #DD6F48;">SELECT</span> <span style="color: #FE8019;">MAX</span>(salary)
    <span style="color: #DD6F48;">FROM</span> employees
    <span style="color: #DD6F48;">WHERE</span> department_id = v_dept_id
  );
  DBMS_OUTPUT.PUT_LINE(
    <span style="color: #528B8B;">'Department: '</span> || 
    v_dept_name ||
    chr(13) ||
    chr(10) ||
    <span style="color: #528B8B;">'Highest salary: '</span> ||
    v_name ||
    <span style="color: #528B8B;">' '</span> || 
    v_salary
  );
<span style="color: #DD6F48;">END</span>;
/
</pre>
</div>
<p>
<a href="../sql-files/procedures/grootste_dept.sql">sql bestand</a>
</p>

<p>
Deze procedure kan je uitvoeren door op de SQL‐prompt in te tikken:
</p>
<pre class="example">
SQL&gt; EXEC grootste_dept 
</pre>
</div>
</div>
