SEMESTER-2/Big Data/big-data-exercises-pxl.gitlab.io-master-public/public/plsql/procedures.org
** Opgave 3 
Schrijf een procedure (minimumlonen) die ervoor zorgt dat als in een 
bepaald land nieuwe wetgeving van kracht gaat ivm minimumlonen, 
de eventueel nodige salarisaanpassingen van de employees gemakkelijk in 
de databank doorgevoerd kunnen worden.

Invoerparameters: de landnaam en het nieuwe minimumloon dat daar vanaf 
nu geldig is. \\
Bewaar deze procedure als proc_minimumlonen.sql om in opdracht 4 te kunnen 
wijzigen.

#+BEGIN_SRC plsql
CREATE OR REPLACE PROCEDURE minimumlonen(
  p_country_name IN countries.country_name%type, 
  p_min_salary IN employees.salary%type
)
IS
BEGIN
  UPDATE employees
  SET salary = p_min_salary
  WHERE department_id 
  IN (
    SELECT department_id
    FROM departments
    WHERE location_id 
    IN (
      SELECT location_id
      FROM locations
      WHERE country_id
      IN (
        SELECT country_id
        FROM countries
        WHERE country_name = p_country_name
      )
    )
  )
  AND salary < p_min_salary;
END;
/
#+END_SRC
[[file:../sql-files/procedures/proc_minimumlonen.sql][sql bestand]]

Deze procedure kan je uitvoeren door aan de SQL‐prompt in te tikken:
#+BEGIN_SRC
SQL> EXEC minimumlonen('Canada',6250) 
#+END_SRC

Controleer vooraf even of er een employee is uit Canada die minder 
verdient dan 6250. En check dan achteraf of er een aanpassing heeft 
plaatsgevonden. 

Je kan dit checken via het volgende commando. \\ 
(Rechtermuisnop is plakken, yank niet na het voor de GNU Emacs gebruikers.)

#+BEGIN_SRC plsql
SELECT salary
FROM employees 
JOIN departments
USING (department_id)
JOIN locations
USING (location_id)
JOIN countries
USING (country_id)
WHERE country_id = 'CA';
#+END_SRC
** Opgave 4 
Wijzig de procedure uit opdracht 3 zodat het calling programma 
een melding terugkrijgt van het aantal gewijzigde records/rijen en dit 
afdrukt: 

- via een anoniem block 
- via een bind‐variable

#+BEGIN_SRC plsql
CREATE OR REPLACE PROCEDURE minimumlonen(
  p_country_name IN countries.country_name%type, 
  p_min_salary IN employees.salary%type,
  p_rowcount OUT NUMBER
)
IS
BEGIN
  UPDATE employees
  SET salary = p_min_salary
  WHERE department_id 
  IN (
    SELECT department_id
    FROM departments
    WHERE location_id 
    IN (
      SELECT location_id
      FROM locations
      WHERE country_id
      IN (
        SELECT country_id
        FROM countries
        WHERE country_name = p_country_name
      )
    )
  )
  AND salary < p_min_salary;
  p_rowcount := SQL%rowcount;
END;
/
#+END_SRC
[[file:../sql-files/procedures/minimumlonen.sql][sql bestand]]

Je kan dit programma als volgt oproepen (bind-variable):

#+BEGIN_SRC
SQL> VARIABLE b_v_rowcount NUMBER;
SQL> EXEC minimumlonen('Canada',6250,:b_v_rowcount)
#+END_SRC

Dit is hoe het caller programma eruit kan zien (anoniem block):

#+BEGIN_SRC plsql
DECLARE
  v_rowcount NUMBER;
BEGIN
  minimumlonen('Canada', 2000, v_rowcount);
  DBMS_OUTPUT.PUT_LINE(v_rowcount);
END;
/
#+END_SRC
[[file:../sql-files/procedures/minimumlonen_caller.sql][sql bestand]]

Je kan de **functie** als volgt oproepen:
#+BEGIN_SRC
SQL> START <pathNaarBestand>/minimumlonen_caller
#+END_SRC

** Opgave 5 
Maak een procedure (asterisk_sal) die van een opgegeven werknemer 
(employee_id) het salaris in sterretjes afdrukt. Elke ster vertegenwoordigt 
1000 euro.

#+BEGIN_SRC plsql
CREATE OR REPLACE PROCEDURE asterisk_sal(
   p_employee_id IN employees.employee_id%type
)
AS
  v_salary employees.salary%type;
  v_asterisks VARCHAR2(50);
BEGIN
  SELECT salary 
  INTO v_salary
  FROM employees
  WHERE employee_id = p_employee_id;

  FOR i IN 1 .. ROUND(v_salary/1000)
  LOOP v_asterisks := v_asterisks || '*';
  END LOOP;
  DBMS_OUTPUT.PUT_LINE(
    v_asterisks
  );

  END;
/
#+END_SRC
[[file:../sql-files/procedures/asterisk_sal.sql][sql bestand]]

Deze procedure kan je uitvoeren door aan de SQL‐prompt in te tikken: 
#+BEGIN_SRC
SQL> EXEC asterisk_sal(100) 
#+END_SRC

** Opgave 6 
Wijzig de procedure uit opdracht 5 zodat het calling program het aantal 
sterretjes terugkrijgt en dit afdrukt: 

- via een anoniem block 
- via een bind‐variable 

#+BEGIN_SRC plsql
CREATE OR REPLACE PROCEDURE asterisk_sal(  
  p_employee_id IN employees.employee_id%type,
  p_asterisks OUT VARCHAR2
)
AS
  v_salary employees.salary%type;
  v_asterisks VARCHAR2(50);
BEGIN
  SELECT salary 
  INTO v_salary
  FROM employees
  WHERE employee_id = p_employee_id;

  FOR i IN 1 .. ROUND(v_salary/1000)
  LOOP v_asterisks := v_asterisks || '*';
  END LOOP;

  p_asterisks := v_asterisks;
  END;
/
#+END_SRC
[[file:../sql-files/procedures/asterisk_sal2.sql][sql bestand]]

Voer dit uit voor personeelslid met nummer 100. \\
Je kan dit programma als volgt oproepen (bind-variable):

#+BEGIN_SRC
SQL> VARIABLE b_asterisks VARCHAR2(50);
SQL> EXEC asterisk_sal(100, :b_asterisks)
#+END_SRC

Dit is hoe het caller programma eruit kan zien (anoniem block):

#+BEGIN_SRC plsql
DECLARE
  v_asterisks VARCHAR2(50);
BEGIN
  asterisk_sal(100, v_asterisks);
  DBMS_OUTPUT.PUT_LINE(v_asterisks);
END;
/
#+END_SRC
[[file:../sql-files/procedures/asterisk_sal2_caller.sql][sql bestand]]

Je kan de **functie** als volgt oproepen:
#+BEGIN_SRC
SQL> START <pathNaarBestand>/asterisk_sal_caller
#+END_SRC
