SEMESTER-2/Big Data/big-data-exercises-pxl.gitlab.io-master-public/public/plsql/procedures.html

<div id="outline-container-org60b0c9b" class="outline-2">
<h2 id="org60b0c9b">Opgave 3</h2>
<div class="outline-text-2" id="text-org60b0c9b">
<p>
Schrijf een procedure (minimumlonen) die ervoor zorgt dat als in een 
bepaald land nieuwe wetgeving van kracht gaat ivm minimumlonen, 
de eventueel nodige salarisaanpassingen van de employees gemakkelijk in 
de databank doorgevoerd kunnen worden.
</p>

<p>
Invoerparameters: de landnaam en het nieuwe minimumloon dat daar vanaf 
nu geldig is. <br />
Bewaar deze procedure als proc_minimumlonen.sql om in opdracht 4 te kunnen 
wijzigen.
</p>

<div class="org-src-container">
<pre class="src src-plsql"><span style="color: #DD6F48;">CREATE</span> <span style="color: #DD6F48;">OR</span> REPLACE <span style="color: #DD6F48;">PROCEDURE</span> <span style="color: #A89984;">minimumlonen</span>(
  p_country_name <span style="color: #DD6F48;">IN</span> countries.country_name%<span style="color: #DD6F48;">type</span>, 
  p_min_salary <span style="color: #DD6F48;">IN</span> employees.salary%<span style="color: #DD6F48;">type</span>
)
<span style="color: #DD6F48;">IS</span>
<span style="color: #DD6F48;">BEGIN</span>
  <span style="color: #DD6F48;">UPDATE</span> employees
  <span style="color: #DD6F48;">SET</span> salary = p_min_salary
  <span style="color: #DD6F48;">WHERE</span> department_id 
  <span style="color: #DD6F48;">IN</span> (
    <span style="color: #DD6F48;">SELECT</span> department_id
    <span style="color: #DD6F48;">FROM</span> departments
    <span style="color: #DD6F48;">WHERE</span> location_id 
    <span style="color: #DD6F48;">IN</span> (
      <span style="color: #DD6F48;">SELECT</span> location_id
      <span style="color: #DD6F48;">FROM</span> locations
      <span style="color: #DD6F48;">WHERE</span> country_id
      <span style="color: #DD6F48;">IN</span> (
        <span style="color: #DD6F48;">SELECT</span> country_id
        <span style="color: #DD6F48;">FROM</span> countries
        <span style="color: #DD6F48;">WHERE</span> country_name = p_country_name
      )
    )
  )
  <span style="color: #DD6F48;">AND</span> salary &lt; p_min_salary;
<span style="color: #DD6F48;">END</span>;
/
</pre>
</div>
<p>
<a href="../sql-files/procedures/proc_minimumlonen.sql">sql bestand</a>
</p>

<p>
Deze procedure kan je uitvoeren door aan de SQL‐prompt in te tikken:
</p>
<pre class="example">
SQL&gt; EXEC minimumlonen('Canada',6250) 
</pre>

<p>
Controleer vooraf even of er een employee is uit Canada die minder 
verdient dan 6250. En check dan achteraf of er een aanpassing heeft 
plaatsgevonden. 
</p>

<p>
Je kan dit checken via het volgende commando. <br />
(Rechtermuisnop is plakken, yank niet na het voor de GNU Emacs gebruikers.)
</p>

<div class="org-src-container">
<pre class="src src-plsql"><span style="color: #DD6F48;">SELECT</span> salary
<span style="color: #DD6F48;">FROM</span> employees 
<span style="color: #DD6F48;">JOIN</span> departments
<span style="color: #DD6F48;">USING</span> (department_id)
<span style="color: #DD6F48;">JOIN</span> locations
<span style="color: #DD6F48;">USING</span> (location_id)
<span style="color: #DD6F48;">JOIN</span> countries
<span style="color: #DD6F48;">USING</span> (country_id)
<span style="color: #DD6F48;">WHERE</span> country_id = <span style="color: #528B8B;">'CA'</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc6c7b9c" class="outline-2">
<h2 id="orgc6c7b9c">Opgave 4</h2>
<div class="outline-text-2" id="text-orgc6c7b9c">
<p>
Wijzig de procedure uit opdracht 3 zodat het calling programma 
een melding terugkrijgt van het aantal gewijzigde records/rijen en dit 
afdrukt: 
</p>

<ul class="org-ul">
<li>via een anoniem block</li>
<li>via een bind‐variable</li>
</ul>

<div class="org-src-container">
<pre class="src src-plsql"><span style="color: #DD6F48;">CREATE</span> <span style="color: #DD6F48;">OR</span> REPLACE <span style="color: #DD6F48;">PROCEDURE</span> <span style="color: #A89984;">minimumlonen</span>(
  p_country_name <span style="color: #DD6F48;">IN</span> countries.country_name%<span style="color: #DD6F48;">type</span>, 
  p_min_salary <span style="color: #DD6F48;">IN</span> employees.salary%<span style="color: #DD6F48;">type</span>,
  p_rowcount <span style="color: #DD6F48;">OUT</span> <span style="color: #DD6F48;">NUMBER</span>
)
<span style="color: #DD6F48;">IS</span>
<span style="color: #DD6F48;">BEGIN</span>
  <span style="color: #DD6F48;">UPDATE</span> employees
  <span style="color: #DD6F48;">SET</span> salary = p_min_salary
  <span style="color: #DD6F48;">WHERE</span> department_id 
  <span style="color: #DD6F48;">IN</span> (
    <span style="color: #DD6F48;">SELECT</span> department_id
    <span style="color: #DD6F48;">FROM</span> departments
    <span style="color: #DD6F48;">WHERE</span> location_id 
    <span style="color: #DD6F48;">IN</span> (
      <span style="color: #DD6F48;">SELECT</span> location_id
      <span style="color: #DD6F48;">FROM</span> locations
      <span style="color: #DD6F48;">WHERE</span> country_id
      <span style="color: #DD6F48;">IN</span> (
        <span style="color: #DD6F48;">SELECT</span> country_id
        <span style="color: #DD6F48;">FROM</span> countries
        <span style="color: #DD6F48;">WHERE</span> country_name = p_country_name
      )
    )
  )
  <span style="color: #DD6F48;">AND</span> salary &lt; p_min_salary;
  p_rowcount := <span style="color: #DD6F48;">SQL</span>%rowcount;
<span style="color: #DD6F48;">END</span>;
/
</pre>
</div>
<p>
<a href="../sql-files/procedures/minimumlonen.sql">sql bestand</a>
</p>

<p>
Je kan dit programma als volgt oproepen (bind-variable):
</p>

<pre class="example">
SQL&gt; VARIABLE b_v_rowcount NUMBER;
SQL&gt; EXEC minimumlonen('Canada',6250,:b_v_rowcount)
</pre>

<p>
Dit is hoe het caller programma eruit kan zien (anoniem block):
</p>

<div class="org-src-container">
<pre class="src src-plsql"><span style="color: #DD6F48;">DECLARE</span>
  v_rowcount <span style="color: #DD6F48;">NUMBER</span>;
<span style="color: #DD6F48;">BEGIN</span>
  minimumlonen(<span style="color: #528B8B;">'Canada'</span>, 2000, v_rowcount);
  DBMS_OUTPUT.PUT_LINE(v_rowcount);
<span style="color: #DD6F48;">END</span>;
/
</pre>
</div>
<p>
<a href="../sql-files/procedures/minimumlonen_caller.sql">sql bestand</a>
</p>

<p>
Je kan de <b><b>functie</b></b> als volgt oproepen:
</p>
<pre class="example">
SQL&gt; START &lt;pathNaarBestand&gt;/minimumlonen_caller
</pre>
</div>
</div>

<div id="outline-container-org82be2fc" class="outline-2">
<h2 id="org82be2fc">Opgave 5</h2>
<div class="outline-text-2" id="text-org82be2fc">
<p>
Maak een procedure (asterisk_sal) die van een opgegeven werknemer 
(employee_id) het salaris in sterretjes afdrukt. Elke ster vertegenwoordigt 
1000 euro.
</p>

<div class="org-src-container">
<pre class="src src-plsql"><span style="color: #DD6F48;">CREATE</span> <span style="color: #DD6F48;">OR</span> REPLACE <span style="color: #DD6F48;">PROCEDURE</span> <span style="color: #A89984;">asterisk_sal</span>(
   p_employee_id <span style="color: #DD6F48;">IN</span> employees.employee_id%<span style="color: #DD6F48;">type</span>
)
<span style="color: #DD6F48;">AS</span>
  v_salary employees.salary%<span style="color: #DD6F48;">type</span>;
  v_asterisks VARCHAR2(50);
<span style="color: #DD6F48;">BEGIN</span>
  <span style="color: #DD6F48;">SELECT</span> salary 
  <span style="color: #DD6F48;">INTO</span> v_salary
  <span style="color: #DD6F48;">FROM</span> employees
  <span style="color: #DD6F48;">WHERE</span> employee_id = p_employee_id;

  <span style="color: #DD6F48;">FOR</span> i <span style="color: #DD6F48;">IN</span> 1 .. ROUND(v_salary/1000)
  LOOP v_asterisks := v_asterisks || <span style="color: #528B8B;">'*'</span>;
  <span style="color: #DD6F48;">END</span> LOOP;
  DBMS_OUTPUT.PUT_LINE(
    v_asterisks
  );

  <span style="color: #DD6F48;">END</span>;
/
</pre>
</div>
<p>
<a href="../sql-files/procedures/asterisk_sal.sql">sql bestand</a>
</p>

<p>
Deze procedure kan je uitvoeren door aan de SQL‐prompt in te tikken: 
</p>
<pre class="example">
SQL&gt; EXEC asterisk_sal(100) 
</pre>
</div>
</div>

<div id="outline-container-org243a50d" class="outline-2">
<h2 id="org243a50d">Opgave 6</h2>
<div class="outline-text-2" id="text-org243a50d">
<p>
Wijzig de procedure uit opdracht 5 zodat het calling program het aantal 
sterretjes terugkrijgt en dit afdrukt: 
</p>

<ul class="org-ul">
<li>via een anoniem block</li>
<li>via een bind‐variable</li>
</ul>

<div class="org-src-container">
<pre class="src src-plsql"><span style="color: #DD6F48;">CREATE</span> <span style="color: #DD6F48;">OR</span> REPLACE <span style="color: #DD6F48;">PROCEDURE</span> <span style="color: #A89984;">asterisk_sal</span>(  
  p_employee_id <span style="color: #DD6F48;">IN</span> employees.employee_id%<span style="color: #DD6F48;">type</span>,
  p_asterisks <span style="color: #DD6F48;">OUT</span> VARCHAR2
)
<span style="color: #DD6F48;">AS</span>
  v_salary employees.salary%<span style="color: #DD6F48;">type</span>;
  v_asterisks VARCHAR2(50);
<span style="color: #DD6F48;">BEGIN</span>
  <span style="color: #DD6F48;">SELECT</span> salary 
  <span style="color: #DD6F48;">INTO</span> v_salary
  <span style="color: #DD6F48;">FROM</span> employees
  <span style="color: #DD6F48;">WHERE</span> employee_id = p_employee_id;

  <span style="color: #DD6F48;">FOR</span> i <span style="color: #DD6F48;">IN</span> 1 .. ROUND(v_salary/1000)
  LOOP v_asterisks := v_asterisks || <span style="color: #528B8B;">'*'</span>;
  <span style="color: #DD6F48;">END</span> LOOP;

  p_asterisks := v_asterisks;
  <span style="color: #DD6F48;">END</span>;
/
</pre>
</div>
<p>
<a href="../sql-files/procedures/asterisk_sal2.sql">sql bestand</a>
</p>

<p>
Voer dit uit voor personeelslid met nummer 100. <br />
Je kan dit programma als volgt oproepen (bind-variable):
</p>

<pre class="example">
SQL&gt; VARIABLE b_asterisks VARCHAR2(50);
SQL&gt; EXEC asterisk_sal(100, :b_asterisks)
</pre>

<p>
Dit is hoe het caller programma eruit kan zien (anoniem block):
</p>

<div class="org-src-container">
<pre class="src src-plsql"><span style="color: #DD6F48;">DECLARE</span>
  v_asterisks VARCHAR2(50);
<span style="color: #DD6F48;">BEGIN</span>
  asterisk_sal(100, v_asterisks);
  DBMS_OUTPUT.PUT_LINE(v_asterisks);
<span style="color: #DD6F48;">END</span>;
/
</pre>
</div>
<p>
<a href="../sql-files/procedures/asterisk_sal2_caller.sql">sql bestand</a>
</p>

<p>
Je kan de <b><b>functie</b></b> als volgt oproepen:
</p>
<pre class="example">
SQL&gt; START &lt;pathNaarBestand&gt;/asterisk_sal_caller
</pre>
</div>
</div>
