SEMESTER-2/Big Data/big-data-exercises-pxl.gitlab.io-master-public/public/plsql/procedures.org
** Opgave 7 
Maak een procedure (landenlijst) die alle landen uit de tabel countries in een 
lijst afdrukt en druk op het einde van de lijst ook als volgt af over hoeveel 
landen het gaat: “We hebben connecties in ... landen.’

#+BEGIN_SRC plsql
CREATE OR REPLACE PROCEDURE landenlijst
IS
  v_number_of_countries integer(4) := 0;
BEGIN
  FOR country IN (
    SELECT country_name
    FROM countries
  )
  LOOP 
    DBMS_OUTPUT.PUT_LINE(country.country_name);
    v_number_of_countries := v_number_of_countries + 1;
  END LOOP;
  DBMS_OUTPUT.PUT_LINE(
    'We hebben connecties in ' || 
    v_number_of_countries ||
    ' landen.'
  );
END;
/
#+END_SRC
[[file:../sql-files/procedures/landenlijst.sql][sql bestand]]

Deze procedure kan je uitvoeren door aan de SQL‐prompt in te tikken:
#+BEGIN_SRC
SQL> EXEC landenlijst 
#+END_SRC

** Opgave 8
Maak een procedure die kan opgeroepen worden met de naam “country_dept” en die 
een land_id mee krijgt vanuit het calling programma. Deze procedure moet alle 
departementnamen gevestigd in dit land onder elkaar afdrukken. Indien er geen 
enkel departement gevestigd is in dit land dan moet er worden afgedrukt: “Er 
zijn geen departementen gevestigd in het land met id ... [land_id]”. 

#+BEGIN_SRC plsql
CREATE OR REPLACE PROCEDURE country_dept(
  p_country_id IN countries.country_id%type
)
AS
  v_max NUMBER(5);
  v_laagste_id departments.department_id%type;
  v_department_id departments.department_id%type;
  v_counter NUMBER(3) :=1;
  v_department_name departments.department_name%type;
BEGIN
  SELECT COUNT(location_id) INTO v_max
  FROM departments JOIN locations
  USING (location_id)
  WHERE country_id = p_country_id;

  IF v_max = 0 THEN
    DBMS_OUTPUT.PUT_LINE(
      'Er zijn geen departementen gevestigd in het land met id ' ||
      p_country_id
    );
  ELSE
  FOR department IN (
    SELECT department_name
    FROM departments JOIN locations
    USING (location_id)
    WHERE country_id = p_country_id
  )
  LOOP
    DBMS_OUTPUT.PUT_LINE(
      department.department_name 
    );
  END LOOP;
  END IF;
  END;
/
#+END_SRC
[[file:../sql-files/procedures/country_dept.sql][sql bestand]]

Je kan dit programma als volgt oproepen:
#+BEGIN_SRC
SQL> EXEC country_dept(5);
SQL> EXEC country_dept('US');
#+END_SRC

** Opgave 9
Maak een procedure die het volgende doet: 

- Vanuit het calling programma wordt een department_id en een percentage voor 
  loonsverhoging meegegeven 
- van dit departement wordt bovenaan de lijst de naam van het departement (‘
  Het gekozen departement is: ... [naam departement]) afgedrukt en daaronder 
  alle werknemers(naam en id) die er werken met hun huidige salaris
- deze werknemers krijgen een loonsverhoging volgens het meegegeven percentage 
- na een blanco regel wordt het aantal salarisverhogingen afgedrukt 
  voorafgegaan door de tekst “Aantal salarisverhogingen: ...” 
- op een nieuwe regel wordt volgende titel afgedrukt: “SITUATIE NA WIJZIGING.” 
  En daaronder worden alle werknemers met hun nieuwe salaris afgedrukt. 

#+BEGIN_SRC plsql
CREATE OR REPLACE PROCEDURE raise_salary(
  p_department_id employees.department_id%type,
  p_percent_raise NUMBER
)
AS
  v_name_dep departments.department_name%type;
  v_raise NUMBER;
  v_raises NUMBER := 0;
  BEGIN
    v_raise := p_percent_raise / 100;
    --2
    SELECT department_name
    INTO v_name_dep
    FROM departments
    WHERE department_id = p_department_id;
    DBMS_OUTPUT.PUT_LINE(
      'Het gekozen departement is: ' ||
      TO_CHAR(v_name_dep) 
    );
    FOR employee IN (
      SELECT last_name, employee_id, salary
      FROM employees
      WHERE department_id = p_department_id
    ) 
    LOOP
      DBMS_OUTPUT.PUT_LINE(
        employee.last_name || 
        CHR(9) || 
        employee.employee_id || 
        CHR(9) || 
        employee.salary
      );

     --3
     UPDATE employees 
     SET salary = (employee.salary * v_raise) + 
       employee.salary 
     WHERE employee_id = employee.employee_id;
     v_raises := v_raises + 1;
   END LOOP;
   --4
   DBMS_OUTPUT.PUT_LINE('');
   DBMS_OUTPUT.PUT_LINE(
     'Aantal salarisverhogingen: ' ||
     v_raises
   );

   --5
   DBMS_OUTPUT.PUT_LINE(
     'SITUATIE NA WIJZIGING'
   );
   FOR employee IN (
     SELECT last_name, employee_id, salary
     FROM employees
     WHERE department_id = p_department_id
   )
   LOOP
     DBMS_OUTPUT.PUT_LINE(
       employee.last_name ||
       CHR(9) || 
       employee.employee_id ||
       CHR(9) || 
       employee.salary
     );
   END LOOP;
 END;
/
#+END_SRC

[[file:../sql-files/procedures/raise_salary.sql][sql bestand]]

Deze procedure kan je uitvoeren door aan de SQL‐prompt in te tikken:
#+BEGIN_SRC
SQL> EXEC raise_salary(40,1)
#+END_SRC

