SEMESTER-2/Big Data/big-data-exercises-pxl.gitlab.io-master-public/public/plsql/procedures.html
<div id="outline-container-orgf0b594e" class="outline-2">
<h2 id="orgf0b594e">Opgave 7</h2>
<div class="outline-text-2" id="text-orgf0b594e">
<p>
Maak een procedure (landenlijst) die alle landen uit de tabel countries in een 
lijst afdrukt en druk op het einde van de lijst ook als volgt af over hoeveel 
landen het gaat: “We hebben connecties in &#x2026; landen.’
</p>

<div class="org-src-container">
<pre class="src src-plsql"><span style="color: #DD6F48;">CREATE</span> <span style="color: #DD6F48;">OR</span> REPLACE <span style="color: #DD6F48;">PROCEDURE</span> <span style="color: #A89984;">landenlijst</span>
<span style="color: #DD6F48;">IS</span>
  v_number_of_countries <span style="color: #66999D;">integer</span>(4) := 0;
<span style="color: #DD6F48;">BEGIN</span>
  <span style="color: #DD6F48;">FOR</span> country <span style="color: #DD6F48;">IN</span> (
    <span style="color: #DD6F48;">SELECT</span> country_name
    <span style="color: #DD6F48;">FROM</span> countries
  )
  LOOP 
    DBMS_OUTPUT.PUT_LINE(country.country_name);
    v_number_of_countries := v_number_of_countries + 1;
  <span style="color: #DD6F48;">END</span> LOOP;
  DBMS_OUTPUT.PUT_LINE(
    <span style="color: #528B8B;">'We hebben connecties in '</span> || 
    v_number_of_countries ||
    <span style="color: #528B8B;">' landen.'</span>
  );
<span style="color: #DD6F48;">END</span>;
/
</pre>
</div>
<p>
<a href="../sql-files/procedures/landenlijst.sql">sql bestand</a>
</p>

<p>
Deze procedure kan je uitvoeren door aan de SQL‐prompt in te tikken:
</p>
<pre class="example">
SQL&gt; EXEC landenlijst 
</pre>
</div>
</div>

<div id="outline-container-org6e6d045" class="outline-2">
<h2 id="org6e6d045">Opgave 8</h2>
<div class="outline-text-2" id="text-org6e6d045">
<p>
Maak een procedure die kan opgeroepen worden met de naam “country_dept” en die 
een land_id mee krijgt vanuit het calling programma. Deze procedure moet alle 
departementnamen gevestigd in dit land onder elkaar afdrukken. Indien er geen 
enkel departement gevestigd is in dit land dan moet er worden afgedrukt: “Er 
zijn geen departementen gevestigd in het land met id &#x2026; [land_id]”. 
</p>

<div class="org-src-container">
<pre class="src src-plsql"><span style="color: #DD6F48;">CREATE</span> <span style="color: #DD6F48;">OR</span> REPLACE <span style="color: #DD6F48;">PROCEDURE</span> <span style="color: #A89984;">country_dept</span>(
  p_country_id <span style="color: #DD6F48;">IN</span> countries.country_id%<span style="color: #DD6F48;">type</span>
)
<span style="color: #DD6F48;">AS</span>
  v_max <span style="color: #DD6F48;">NUMBER</span>(5);
  v_laagste_id departments.department_id%<span style="color: #DD6F48;">type</span>;
  v_department_id departments.department_id%<span style="color: #DD6F48;">type</span>;
  v_counter <span style="color: #DD6F48;">NUMBER</span>(3) :=1;
  v_department_name departments.department_name%<span style="color: #DD6F48;">type</span>;
<span style="color: #DD6F48;">BEGIN</span>
  <span style="color: #DD6F48;">SELECT</span> <span style="color: #FE8019;">COUNT</span>(location_id) <span style="color: #DD6F48;">INTO</span> v_max
  <span style="color: #DD6F48;">FROM</span> departments <span style="color: #DD6F48;">JOIN</span> locations
  <span style="color: #DD6F48;">USING</span> (location_id)
  <span style="color: #DD6F48;">WHERE</span> country_id = p_country_id;

  IF v_max = 0 <span style="color: #DD6F48;">THEN</span>
    DBMS_OUTPUT.PUT_LINE(
      <span style="color: #528B8B;">'Er zijn geen departementen gevestigd in het land met id '</span> ||
      p_country_id
    );
  <span style="color: #DD6F48;">ELSE</span>
  <span style="color: #DD6F48;">FOR</span> department <span style="color: #DD6F48;">IN</span> (
    <span style="color: #DD6F48;">SELECT</span> department_name
    <span style="color: #DD6F48;">FROM</span> departments <span style="color: #DD6F48;">JOIN</span> locations
    <span style="color: #DD6F48;">USING</span> (location_id)
    <span style="color: #DD6F48;">WHERE</span> country_id = p_country_id
  )
  LOOP
    DBMS_OUTPUT.PUT_LINE(
      department.department_name 
    );
  <span style="color: #DD6F48;">END</span> LOOP;
  <span style="color: #DD6F48;">END</span> IF;
  <span style="color: #DD6F48;">END</span>;
/
</pre>
</div>
<p>
<a href="../sql-files/procedures/country_dept.sql">sql bestand</a>
</p>

<p>
Je kan dit programma als volgt oproepen:
</p>
<pre class="example">
SQL&gt; EXEC country_dept(5);
SQL&gt; EXEC country_dept('US');
</pre>
</div>
</div>

<div id="outline-container-org39f70d3" class="outline-2">
<h2 id="org39f70d3">Opgave 9</h2>
<div class="outline-text-2" id="text-org39f70d3">
<p>
Maak een procedure die het volgende doet: 
</p>

<ul class="org-ul">
<li>Vanuit het calling programma wordt een department_id en een percentage voor 
loonsverhoging meegegeven</li>
<li>van dit departement wordt bovenaan de lijst de naam van het departement (‘
Het gekozen departement is: &#x2026; [naam departement]) afgedrukt en daaronder 
alle werknemers(naam en id) die er werken met hun huidige salaris</li>
<li>deze werknemers krijgen een loonsverhoging volgens het meegegeven percentage</li>
<li>na een blanco regel wordt het aantal salarisverhogingen afgedrukt 
voorafgegaan door de tekst “Aantal salarisverhogingen: &#x2026;”</li>
<li>op een nieuwe regel wordt volgende titel afgedrukt: “SITUATIE NA WIJZIGING.” 
En daaronder worden alle werknemers met hun nieuwe salaris afgedrukt.</li>
</ul>

<div class="org-src-container">
<pre class="src src-plsql"><span style="color: #DD6F48;">CREATE</span> <span style="color: #DD6F48;">OR</span> REPLACE <span style="color: #DD6F48;">PROCEDURE</span> <span style="color: #A89984;">raise_salary</span>(
  p_department_id employees.department_id%<span style="color: #DD6F48;">type</span>,
  p_percent_raise <span style="color: #DD6F48;">NUMBER</span>
)
<span style="color: #DD6F48;">AS</span>
  v_name_dep departments.department_name%<span style="color: #DD6F48;">type</span>;
  v_raise <span style="color: #DD6F48;">NUMBER</span>;
  v_raises <span style="color: #DD6F48;">NUMBER</span> := 0;
  <span style="color: #DD6F48;">BEGIN</span>
    v_raise := p_percent_raise / 100;
    <span style="color: #7C6F64;">--2</span>
    <span style="color: #DD6F48;">SELECT</span> department_name
    <span style="color: #DD6F48;">INTO</span> v_name_dep
    <span style="color: #DD6F48;">FROM</span> departments
    <span style="color: #DD6F48;">WHERE</span> department_id = p_department_id;
    DBMS_OUTPUT.PUT_LINE(
      <span style="color: #528B8B;">'Het gekozen departement is: '</span> ||
      TO_CHAR(v_name_dep) 
    );
    <span style="color: #DD6F48;">FOR</span> employee <span style="color: #DD6F48;">IN</span> (
      <span style="color: #DD6F48;">SELECT</span> last_name, employee_id, salary
      <span style="color: #DD6F48;">FROM</span> employees
      <span style="color: #DD6F48;">WHERE</span> department_id = p_department_id
    ) 
    LOOP
      DBMS_OUTPUT.PUT_LINE(
        employee.last_name || 
        CHR(9) || 
        employee.employee_id || 
        CHR(9) || 
        employee.salary
      );

     <span style="color: #7C6F64;">--3</span>
     <span style="color: #DD6F48;">UPDATE</span> employees 
     <span style="color: #DD6F48;">SET</span> salary = (employee.salary * v_raise) + 
       employee.salary 
     <span style="color: #DD6F48;">WHERE</span> employee_id = employee.employee_id;
     v_raises := v_raises + 1;
   <span style="color: #DD6F48;">END</span> LOOP;
   <span style="color: #7C6F64;">--4</span>
   DBMS_OUTPUT.PUT_LINE(<span style="color: #528B8B;">''</span>);
   DBMS_OUTPUT.PUT_LINE(
     <span style="color: #528B8B;">'Aantal salarisverhogingen: '</span> ||
     v_raises
   );

   <span style="color: #7C6F64;">--5</span>
   DBMS_OUTPUT.PUT_LINE(
     <span style="color: #528B8B;">'SITUATIE NA WIJZIGING'</span>
   );
   <span style="color: #DD6F48;">FOR</span> employee <span style="color: #DD6F48;">IN</span> (
     <span style="color: #DD6F48;">SELECT</span> last_name, employee_id, salary
     <span style="color: #DD6F48;">FROM</span> employees
     <span style="color: #DD6F48;">WHERE</span> department_id = p_department_id
   )
   LOOP
     DBMS_OUTPUT.PUT_LINE(
       employee.last_name ||
       CHR(9) || 
       employee.employee_id ||
       CHR(9) || 
       employee.salary
     );
   <span style="color: #DD6F48;">END</span> LOOP;
 <span style="color: #DD6F48;">END</span>;
/
</pre>
</div>

<p>
<a href="../sql-files/procedures/raise_salary.sql">sql bestand</a>
</p>

<p>
Deze procedure kan je uitvoeren door aan de SQL‐prompt in te tikken:
</p>
<pre class="example">
SQL&gt; EXEC raise_salary(40,1)
</pre>
</div>
</div>
