SEMESTER-2/Big Data/big-data-exercises-pxl.gitlab.io-master-public/public/plsql/procedures.org
** Opgave 10
Schrijf een procedure die onderstaand overzicht maakt van alle steden uit een 
bepaald land waarvan het id (in voorbeeld US) wordt meegegeven vanuit het 
calling program. Het totaal aantal werknemers voor dit land wordt teruggegeven 
aan het calling program. Indien er geen afdelingen gevestigd zijn in dit land, 
dan wordt er niks afgedrukt. Voor dit land toon je de afdelingen per locatie 
met hun aantal werknemers zoals volgt:
 
   ==> United States of America ‐ 1700 Seattle   \\
Administration: 1 werknemers \\
Accounting: 2 werknemers \\
Purchasing: 6 werknemers \\
Executive: 3 werknemers \\
Finance: 6 werknemers \\
==> United States of America ‐ 1400 Southlake \\ 
IT: 5 werknemers \\
==> United States of America \\
 ‐ 1500 South San Francisco \\
Shipping: 45 werknemers

#+BEGIN_SRC plsql
CREATE OR REPLACE PROCEDURE show_cities(
  p_country_id IN locations.country_id%type,
  p_count_location OUT NUMBER
)
AS
  v_country_name countries.country_name%type;
BEGIN
  p_count_location :=0;
  FOR location IN (
    SELECT *
    FROM locations
    WHERE country_id = p_country_id
    AND location_id IN (
      SELECT location_id FROM departments
    )
  )
  LOOP
    SELECT country_name INTO v_country_name
    FROM countries
    WHERE country_id = location.country_id;
    DBMS_OUTPUT.PUT_LINE(
      '==> ' ||
      v_country_name ||
      ' - ' ||
      location.location_id || 
      ' ' || 
      location.city
    );
    FOR department IN (
      SELECT department_name, COUNT(*) NUMBER_of_departments
      FROM departments JOIN employees USING (department_id)
      WHERE departments.location_id = location.location_id
      GROUP BY department_name
    )
    LOOP
      DBMS_OUTPUT.PUT_LINE(
        department.department_name || 
        ': ' || 
        department.NUMBER_of_departments
      );
      p_count_location := p_count_location + department.NUMBER_of_departments;
    END LOOP;
  END LOOP;
  END;
/
#+END_SRC
[[file:../sql-files/procedures/show_cities.sql][sql bestand]]

Deze procedure kan je uitvoeren door aan de SQL‐prompt in te tikken:
#+BEGIN_SRC
SQL> EXEC show_cities(40,1)
#+END_SRC

Je kan dit programma als volgt oproepen (bind-variable):
#+BEGIN_SRC
SQL> VARIABLE b_NUMBER_of_departments NUMBER(5);
SQL> show_cities('US', b_NUMBER_of_departments)
#+END_SRC

Dit is hoe het caller programma eruit kan zien (anoniem block):
#+BEGIN_SRC plsql
DECLARE
  v_NUMBER_of_departments NUMBER(5);
BEGIN
  show_cities('US', v_NUMBER_of_departments);
  DBMS_OUTPUT.PUT_LINE(v_NUMBER_of_departments);
END;
/
#+END_SRC
[[file:../sql-files/procedures/show_cities_caller.sql][sql bestand]]

Je kan de **functie** als volgt oproepen:
#+BEGIN_SRC
SQL> START <pathNaarBestand>/show_cities_caller
#+END_SRC

[[file:../index.org][Home]] > [[file:plsql.org][PLSQL]] > Procedures
