SEMESTER-2/Big Data/big-data-exercises-pxl.gitlab.io-master-public/public/plsql/procedures.html

<div id="outline-container-org8689495" class="outline-2">
<h2 id="org8689495">Opgave 10</h2>
<div class="outline-text-2" id="text-org8689495">
<p>
Schrijf een procedure die onderstaand overzicht maakt van alle steden uit een 
bepaald land waarvan het id (in voorbeeld US) wordt meegegeven vanuit het 
calling program. Het totaal aantal werknemers voor dit land wordt teruggegeven 
aan het calling program. Indien er geen afdelingen gevestigd zijn in dit land, 
dan wordt er niks afgedrukt. Voor dit land toon je de afdelingen per locatie 
met hun aantal werknemers zoals volgt:
</p>

<p>
   ==&gt; United States of America ‐ 1700 Seattle   <br />
Administration: 1 werknemers <br />
Accounting: 2 werknemers <br />
Purchasing: 6 werknemers <br />
Executive: 3 werknemers <br />
Finance: 6 werknemers <br />
==&gt; United States of America ‐ 1400 Southlake <br />
IT: 5 werknemers <br />
==&gt; United States of America <br />
 ‐ 1500 South San Francisco <br />
Shipping: 45 werknemers
</p>

<div class="org-src-container">
<pre class="src src-plsql"><span style="color: #DD6F48;">CREATE</span> <span style="color: #DD6F48;">OR</span> REPLACE <span style="color: #DD6F48;">PROCEDURE</span> <span style="color: #A89984;">show_cities</span>(
  p_country_id <span style="color: #DD6F48;">IN</span> locations.country_id%<span style="color: #DD6F48;">type</span>,
  p_count_location <span style="color: #DD6F48;">OUT</span> <span style="color: #DD6F48;">NUMBER</span>
)
<span style="color: #DD6F48;">AS</span>
  v_country_name countries.country_name%<span style="color: #DD6F48;">type</span>;
<span style="color: #DD6F48;">BEGIN</span>
  p_count_location :=0;
  <span style="color: #DD6F48;">FOR</span> location <span style="color: #DD6F48;">IN</span> (
    <span style="color: #DD6F48;">SELECT</span> *
    <span style="color: #DD6F48;">FROM</span> locations
    <span style="color: #DD6F48;">WHERE</span> country_id = p_country_id
    <span style="color: #DD6F48;">AND</span> location_id <span style="color: #DD6F48;">IN</span> (
      <span style="color: #DD6F48;">SELECT</span> location_id <span style="color: #DD6F48;">FROM</span> departments
    )
  )
  LOOP
    <span style="color: #DD6F48;">SELECT</span> country_name <span style="color: #DD6F48;">INTO</span> v_country_name
    <span style="color: #DD6F48;">FROM</span> countries
    <span style="color: #DD6F48;">WHERE</span> country_id = location.country_id;
    DBMS_OUTPUT.PUT_LINE(
      <span style="color: #528B8B;">'==&gt; '</span> ||
      v_country_name ||
      <span style="color: #528B8B;">' - '</span> ||
      location.location_id || 
      <span style="color: #528B8B;">' '</span> || 
      location.city
    );
    <span style="color: #DD6F48;">FOR</span> department <span style="color: #DD6F48;">IN</span> (
      <span style="color: #DD6F48;">SELECT</span> department_name, <span style="color: #FE8019;">COUNT</span>(*) NUMBER_of_departments
      <span style="color: #DD6F48;">FROM</span> departments <span style="color: #DD6F48;">JOIN</span> employees <span style="color: #DD6F48;">USING</span> (department_id)
      <span style="color: #DD6F48;">WHERE</span> departments.location_id = location.location_id
      <span style="color: #DD6F48;">GROUP</span> <span style="color: #DD6F48;">BY</span> department_name
    )
    LOOP
      DBMS_OUTPUT.PUT_LINE(
        department.department_name || 
        <span style="color: #528B8B;">': '</span> || 
        department.NUMBER_of_departments
      );
      p_count_location := p_count_location + department.NUMBER_of_departments;
    <span style="color: #DD6F48;">END</span> LOOP;
  <span style="color: #DD6F48;">END</span> LOOP;
  <span style="color: #DD6F48;">END</span>;
/
</pre>
</div>
<p>
<a href="../sql-files/procedures/show_cities.sql">sql bestand</a>
</p>

<p>
Deze procedure kan je uitvoeren door aan de SQL‐prompt in te tikken:
</p>
<pre class="example">
SQL&gt; EXEC show_cities(40,1)
</pre>

<p>
Je kan dit programma als volgt oproepen (bind-variable):
</p>
<pre class="example">
SQL&gt; VARIABLE b_NUMBER_of_departments NUMBER(5);
SQL&gt; show_cities('US', b_NUMBER_of_departments)
</pre>

<p>
Dit is hoe het caller programma eruit kan zien (anoniem block):
</p>
<div class="org-src-container">
<pre class="src src-plsql"><span style="color: #DD6F48;">DECLARE</span>
  v_NUMBER_of_departments <span style="color: #DD6F48;">NUMBER</span>(5);
<span style="color: #DD6F48;">BEGIN</span>
  show_cities(<span style="color: #528B8B;">'US'</span>, v_NUMBER_of_departments);
  DBMS_OUTPUT.PUT_LINE(v_NUMBER_of_departments);
<span style="color: #DD6F48;">END</span>;
/
</pre>
</div>
<p>
<a href="../sql-files/procedures/show_cities_caller.sql">sql bestand</a>
</p>

<p>
Je kan de <b><b>functie</b></b> als volgt oproepen:
</p>
<pre class="example">
SQL&gt; START &lt;pathNaarBestand&gt;/show_cities_caller
</pre>

<p>
<a href="../index.html">Home</a> &gt; <a href="plsql.html">PLSQL</a> &gt; Procedures
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Robin Wils</p>
<p class="date">Created: 2019-08-14 Wed 16:39</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
